[
  {
    "id": "1",
    "period": "February 2021 - Present",
    "company": "Moovit El Salvador",
    "position": "Software Developer",
    "description": "Responsible for the design, planning, development, and deployment of custom software solutions, prioritizing performance, scalability, and maintainability. Also served as a technical lead within the team, promoting best practices and coding standards.",
    "active": true,
    "independent": false,
    "company_contact": {
      "name": "Ing. Julio Velasquez",
      "position": "",
      "email": "",
      "phone": "503 25110900"
    },
    "functions": [
      "Design, planning, development, and deployment of custom software solutions.",
      "Server administration in local and cloud environments (GCP: Compute Engine, Cloud Storage).",
      "Maintenance and monitoring of production systems to ensure stability, security, and high availability.",
      "Taking and analyzing functional and technical requirements directly with clients.",
      "Implementation and maintenance of CI/CD pipelines with Bitbucket for continuous integration and deployment.",
      "Development of APIs and backend services using Go, PHP, and Python, integrating frameworks like Flask and CodeIgniter.",
      "Development of user interfaces mainly with HTML, JavaScript, and PHP, ensuring a fluid and functional experience.",
      "Technical lead, promoting best practices and suggesting task assignment."
    ],
    "achievements": [
      "Technically led teams, promoting good practices and organization to meet business objectives.",
      "Worked across the entire project lifecycle, from planning to production."
    ]
  },
  {
    "id": "2",
    "period": "July 2019 - April 2020",
    "company": "Grupo Remor",
    "position": "Analyst Programmer",
    "description": "In charge of the maintenance and development of internal systems, adapting them to the company's needs based on previously gathered requirements.",
    "active": false,
    "independent": false,
    "company_contact": {},
    "functions": [
      "Maintenance and development of internal systems.",
      "Ensured system stability and optimization to improve performance and functionality."
    ],
    "achievements": []
  }
]
